Terraform plan for __staging__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["command-center"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "command-center"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "1Gi"
                }
              + default_request = {
                  + "cpu"    = "100m"
                  + "memory" = "200Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace.gke_namespace["command-center"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "command-center"
            }
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
              + "project"         = "ebo-staging"
            }
          + name             = "command-center"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "invetory-threshold-push-dl-error"
      + path                       = (known after apply)
      + project                    = "ebo-staging"
      + topic                      = "invetory-threshold-push-dl-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "invetory-threshold-push-dl-error"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #406](https://github.com/ebomart/commerce-infrastructure/actions/runs/1754466516)